app/controllers/cards_controller.rb

    def new
        @deck = Deck.find(params[:deck_id])
---
SELECT  "decks".* FROM "decks" WHERE "decks"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

    def edit
        @deck = Deck.find(params[:deck_id])
        @card = @deck.cards.find(params[:id])
---
SELECT  "decks".* FROM "decks" WHERE "decks"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "cards".* FROM "cards" WHERE "cards"."deck_id" = ? AND "cards"."id" = ? LIMIT ?  [["deck_id", 4], ["id", 1], ["LIMIT", 1]]

    def create
        @deck = Deck.find(params[:deck_id])
        @card = @deck.cards.create(card_params)
---
SELECT  "decks".* FROM "decks" WHERE "decks"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "cards" ("front", "verse", "deck_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["front", "bonjour"], ["verse", "bom dia"], ["deck_id", 4], ["created_at", "2018-05-16 23:51:21.618793"], ["updated_at", "2018-05-16 23:51:21.618793"]]

    def update
        @deck = Deck.find(params[:deck_id])
        @card = @deck.cards.find(params[:id])
        if @card.update(card_params)
---
SELECT  "decks".* FROM "decks" WHERE "decks"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "cards".* FROM "cards" WHERE "cards"."deck_id" = ? AND "cards"."id" = ? LIMIT ?  [["deck_id", 4], ["id", 1], ["LIMIT", 1]]
UPDATE "cards" SET "front" = ?, "verse" = ?, "updated_at" = ? WHERE "cards"."id" = ?  [["front", "bonjour 2"], ["verse", "bom dia 2"], ["updated_at", "2018-05-17 01:16:08.573618"], ["id", 1]]

    def destroy
        @deck = Deck.find(params[:deck_id])
        @card = @deck.cards.find(params[:id])
        @card.destroy
---
SELECT  "decks".* FROM "decks" WHERE "decks"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "cards".* FROM "cards" WHERE "cards"."deck_id" = ? AND "cards"."id" = ? LIMIT ?  [["deck_id", 4], ["id", 3], ["LIMIT", 1]]
DELETE FROM "cards" WHERE "cards"."id" = ?  [["id", 3]]

    def show
        @deck = Deck.find(params[:deck_id])
        @card = @deck.cards.find(params[:id])
---
SELECT  "decks".* FROM "decks" WHERE "decks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "cards".* FROM "cards" WHERE "cards"."deck_id" = ? AND "cards"."id" = ? LIMIT ?  [["deck_id", 4], ["id", 4], ["LIMIT", 1]]