app/controllers/decks_controller.rb

    def edit
        @deck = current_user.decks.find(params[:id])
---
SELECT  "decks".* FROM "decks" WHERE "decks"."user_id" = ? AND "decks"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]

    def create
        @deck = current_user.decks.create(deck_params)
---
INSERT INTO "decks" ("name", "description", "user_id", "shareable", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "tttttt"], ["description", ""], ["user_id", 1], ["shareable", "f"], ["created_at", "2018-06-09 00:48:43.594040"], ["updated_at", "2018-06-09 00:48:43.594040"]]

    def update
        @deck = current_user.decks.find(params[:id])
        if @deck.update(deck_params)
---
SELECT  "decks".* FROM "decks" WHERE "decks"."user_id" = ? AND "decks"."id" = ? LIMIT ?  [["user_id", 1], ["id", 4], ["LIMIT", 1]]
UPDATE "decks" SET "description" = ?, "updated_at" = ? WHERE "decks"."id" = ?  [["description", "Frente - > palavras e expressões em francês\r\n\r\nVerso - > correspondente em português."], ["updated_at", "2018-05-18 02:42:04.607471"], ["id", 5]]

    def destroy
        @deck = Deck.find(params[:id])
        @deck.destroy
---
SELECT  "decks".* FROM "decks" WHERE "decks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "decks" WHERE "decks"."id" = ?  [["id", 1]]

    def show
        @deck = Deck.find(params[:id])
---
SELECT  "decks".* FROM "decks" WHERE "decks"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

    def index
        @deck = current_user.decks.all
---
SELECT  "decks".* FROM "decks" ORDER BY "decks"."id" DESC LIMIT ?  [["LIMIT", 1]]

    def start
        if (params[:card_id] == nil)
            params[:card_id] = 0
        end
        @deck = Deck.find(params[:deck_id])

        if (params[:grade].to_i == 0)
            x = DateTime.now.change({ hour: 23, min: 59, sec: rand(0..58)}).strftime("%Y-%m-%d %H:%M:%S")
        else
            x = (DateTime.now + params[:grade].to_i).strftime("%Y-%m-%d %H:%M:%S")
        end

        Card.where("deck_id = #{params[:deck_id]} AND id = #{params[:card_id]}").update_all("time_to_appear = '#{x}'")
---
SELECT  "decks".* FROM "decks" WHERE "decks"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT "cards".* FROM "cards" WHERE "cards"."deck_id" = ? AND (time_to_appear < 2018-06-09 23:59:59 -0300) ORDER BY time_to_appear ASC  [["deck_id", 1]]
UPDATE "cards" SET "time_to_appear" = '''2018-06-09T02:48:39-03:00''' WHERE (deck_id = 1 AND id = 1)