app/views/decks/index.html.haml

SELECT "decks".* FROM "decks" WHERE (shareable = true)
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
%h1 All Wanki Decks
- for deck in Deck.where("shareable = 't'").all
  %li
    =link_to deck.name + " (User: #{User.where("id = " + deck.user_id.to_s).all[0].email})" , deck_path(deck.id)