app/views/decks/show.html.haml

SELECT COUNT(*) FROM "cards" WHERE "cards"."deck_id" = ?  [["deck_id", 4]]
---
      %strong Number of Cards:
      = @deck.cards.count

SELECT "cards".* FROM "cards" WHERE "cards"."deck_id" = ?  [["deck_id", 4]]
---
      %strong Card list
      -@deck.cards.sort_by{|o| o.front}.each do |card|